Revit 2027 API
RebarInSystem.BarsOnNormalSide Property
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal. For the current implementation of RebarInSystem, this property will always return true, but it is included in the RebarInSystem interface for consistency with the Rebar class.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BarsOnNormalSide { get; }
Public ReadOnly Property BarsOnNormalSide As Boolean
	Get
public:
property bool BarsOnNormalSide {
	bool get ();
}
member BarsOnNormalSide : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace